Revit 2015 API
DirectShape.SetShape Method (IList<GeometryObject>, DirectShapeTargetViewType)
 sets the view-specific Shape of this object to the supplied collection of Geometry objects. The objects are copied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public void SetShape(
	IList<GeometryObject> pGeomArr,
	DirectShapeTargetViewType viewType
)
Visual Basic
Public Sub SetShape ( _
	pGeomArr As IList(Of GeometryObject), _
	viewType As DirectShapeTargetViewType _
)
Visual C++
public:
void SetShape(
	IList<GeometryObject^>^ pGeomArr,
	DirectShapeTargetViewType viewType
)
Parameters
pGeomArr
Type: System.Collections.Generic.IList<GeometryObject>
 Shape of this object expressed as a collection of Geometry objects
viewType
Type: Autodesk.Revit.DB.DirectShapeTargetViewType
 Optional: set a view-specific shape representation that will be used in views of that type only. Passing DirectShapeTargetViewType::Default as view type will cause the default shape to be set.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
DirectShape Class
SetShape Overload
Autodesk.Revit.DB Namespace